TexasInstruments/c2000ware-core-sdk/driverlib/f28p55x/driverlib/pin_map.h
#define GPIO_37_GPIO37                  0x00460A00U
#define GPIO_37_OUTPUTXBAR2             0x00460A01U
#define GPIO_37_SPIA_PTE                0x00460A02U
#define GPIO_37_I2CA_SCL                0x00460A03U
#define GPIO_37_SCIA_TX                 0x00460A05U
#define GPIO_37_MCANB_TX                0x00460A06U
#define GPIO_37_LINA_TX                 0x00460A07U
#define GPIO_37_EQEP1_B                 0x00460A09U
#define GPIO_37_PMBUSA_ALERT            0x00460A0AU
#define GPIO_37_EPWM5_A                 0x00460A0BU
#define GPIO_37_TDO                     0x00460A0FU

#define GPIO_40_GPIO40                  0x00461000U
#define GPIO_40_SPIB_PICO               0x00461001U
#define GPIO_40_EPWM2_B                 0x00461005U
#define GPIO_40_PMBUSA_SDA              0x00461006U
#define GPIO_40_FSIRXA_D0               0x00461007U
#define GPIO_40_SCIB_TX                 0x00461009U
#define GPIO_40_EQEP1_A                 0x0046100AU
#define GPIO_40_LINA_TX                 0x0046100BU
#define GPIO_40_CLB_OUTPUTXBAR4         0x0046100EU
#define GPIO_40_EQEP3_STROBE            0x0046100FU

#define GPIO_41_GPIO41                  0x00461200U
#define GPIO_41_EPWM7_A                 0x00461201U
#define GPIO_41_EPWM2_A                 0x00461205U
#define GPIO_41_PMBUSA_SCL              0x00461206U
#define GPIO_41_FSIRXA_D1               0x00461207U
#define GPIO_41_SCIB_RX                 0x00461209U
#define GPIO_41_EQEP1_B                 0x0046120AU
#define GPIO_41_LINA_RX                 0x0046120BU
#define GPIO_41_EPWM12_B                0x0046120DU
#define GPIO_41_SPIB_POCI               0x0046120EU

#define GPIO_42_GPIO42                  0x00461400U
#define GPIO_42_LINA_RX                 0x00461402U
#define GPIO_42_OUTPUTXBAR5             0x00461403U
#define GPIO_42_PMBUSA_CTL              0x00461405U
#define GPIO_42_I2CA_SDA                0x00461406U
#define GPIO_42_SCIC_RX                 0x00461407U
#define GPIO_42_EQEP1_STROBE            0x0046140AU
#define GPIO_42_CLB_OUTPUTXBAR3         0x0046140BU

#define GPIO_43_GPIO43                  0x00461600U
#define GPIO_43_OUTPUTXBAR6             0x00461603U
#define GPIO_43_PMBUSA_ALERT            0x00461605U
#define GPIO_43_I2CA_SCL                0x00461606U
#define GPIO_43_SCIC_TX                 0x00461607U
#define GPIO_43_EQEP1_INDEX             0x0046160AU
#define GPIO_43_CLB_OUTPUTXBAR4         0x0046160BU

#define GPIO_44_GPIO44                  0x00461800U
#define GPIO_44_OUTPUTXBAR7             0x00461803U
#define GPIO_44_EQEP1_A                 0x00461805U
#define GPIO_44_PMBUSA_SDA              0x00461806U
#define GPIO_44_FSITXA_CLK              0x00461807U
#define GPIO_44_PMBUSA_CTL              0x00461809U
#define GPIO_44_CLB_OUTPUTXBAR3         0x0046180AU
#define GPIO_44_FSIRXA_D0               0x0046180BU
#define GPIO_44_LINA_TX                 0x0046180EU

#define GPIO_45_GPIO45                  0x00461A00U
#define GPIO_45_OUTPUTXBAR8             0x00461A03U
#define GPIO_45_FSITXA_D0               0x00461A07U
#define GPIO_45_PMBUSA_ALERT            0x00461A09U
#define GPIO_45_CLB_OUTPUTXBAR4         0x00461A0AU

#define GPIO_46_GPIO46                  0x00461C00U
#define GPIO_46_LINA_TX                 0x00461C03U
#define GPIO_46_MCANA_TX                0x00461C05U
#define GPIO_46_FSITXA_D1               0x00461C07U
#define GPIO_46_PMBUSA_SDA              0x00461C09U

#define GPIO_47_GPIO47                  0x00461E00U
#define GPIO_47_LINA_RX                 0x00461E03U
#define GPIO_47_MCANA_RX                0x00461E05U
#define GPIO_47_CLB_OUTPUTXBAR2         0x00461E07U
#define GPIO_47_PMBUSA_SCL              0x00461E09U

#define GPIO_48_GPIO48                  0x00480000U
#define GPIO_48_OUTPUTXBAR3             0x00480001U
#define GPIO_48_MCANA_TX                0x00480005U
#define GPIO_48_SCIA_TX                 0x00480006U
#define GPIO_48_PMBUSA_SDA              0x00480009U

#define GPIO_49_GPIO49                  0x00480200U
#define GPIO_49_OUTPUTXBAR4             0x00480201U
#define GPIO_49_MCANA_RX                0x00480205U
#define GPIO_49_SCIA_RX                 0x00480206U
#define GPIO_49_LINA_RX                 0x00480209U
#define GPIO_49_FSITXA_D0               0x0048020EU

#define GPIO_50_GPIO50                  0x00480400U
#define GPIO_50_EQEP1_A                 0x00480401U
#define GPIO_50_MCANA_TX                0x00480405U
#define GPIO_50_SPIB_PICO               0x00480406U
#define GPIO_50_I2CB_SDA                0x00480409U
#define GPIO_50_FSITXA_D1               0x0048040EU

#define GPIO_51_GPIO51                  0x00480600U
#define GPIO_51_EQEP1_B                 0x00480601U
#define GPIO_51_MCANA_RX                0x00480605U
#define GPIO_51_SPIB_POCI               0x00480606U
#define GPIO_51_I2CB_SCL                0x00480609U
#define GPIO_51_FSITXA_CLK              0x0048060EU

#define GPIO_52_GPIO52                  0x00480800U
#define GPIO_52_EQEP1_STROBE            0x00480801U
#define GPIO_52_CLB_OUTPUTXBAR5         0x00480805U
#define GPIO_52_SPIB_CLK                0x00480806U
#define GPIO_52_SYNCOUT                 0x00480809U
#define GPIO_52_FSIRXA_D0               0x0048080EU

#define GPIO_53_GPIO53                  0x00480A00U
#define GPIO_53_EQEP1_INDEX             0x00480A01U
#define GPIO_53_CLB_OUTPUTXBAR6         0x00480A05U
#define GPIO_53_SPIB_PTE                0x00480A06U
#define GPIO_53_ADCSOCAO                0x00480A09U
#define GPIO_53_MCANB_RX                0x00480A0AU
#define GPIO_53_FSIRXA_D1               0x00480A0EU

#define GPIO_54_GPIO54                  0x00480C00U
#define GPIO_54_SPIA_PICO               0x00480C01U
#define GPIO_54_EQEP2_A                 0x00480C05U
#define GPIO_54_OUTPUTXBAR2             0x00480C06U
#define GPIO_54_ADCSOCBO                0x00480C09U
#define GPIO_54_LINA_TX                 0x00480C0AU
#define GPIO_54_FSIRXA_CLK              0x00480C0EU

#define GPIO_55_GPIO55                  0x00480E00U
#define GPIO_55_SPIA_POCI               0x00480E01U
#define GPIO_55_EQEP2_B                 0x00480E05U
#define GPIO_55_OUTPUTXBAR3             0x00480E06U
#define GPIO_55_ERRORSTS                0x00480E09U
#define GPIO_55_LINA_RX                 0x00480E0AU

#define GPIO_56_GPIO56                  0x00481000U
#define GPIO_56_SPIA_CLK                0x00481001U
#define GPIO_56_CLB_OUTPUTXBAR7         0x00481002U
#define GPIO_56_MCANA_TX                0x00481003U
#define GPIO_56_EQEP2_STROBE            0x00481005U
#define GPIO_56_SCIB_TX                 0x00481006U
#define GPIO_56_SPIB_PICO               0x00481009U
#define GPIO_56_I2CA_SDA                0x0048100AU
#define GPIO_56_EQEP1_A                 0x0048100BU
#define GPIO_56_FSIRXA_D1               0x0048100EU

#define GPIO_57_GPIO57                  0x00481200U
#define GPIO_57_SPIA_PTE                0x00481201U
#define GPIO_57_CLB_OUTPUTXBAR8         0x00481202U
#define GPIO_57_MCANA_RX                0x00481203U
#define GPIO_57_EQEP2_INDEX             0x00481205U
#define GPIO_57_SCIB_RX                 0x00481206U
#define GPIO_57_SPIB_POCI               0x00481209U
#define GPIO_57_I2CA_SCL                0x0048120AU
#define GPIO_57_EQEP1_B                 0x0048120BU
#define GPIO_57_FSIRXA_CLK              0x0048120EU

#define GPIO_58_GPIO58                  0x00481400U
#define GPIO_58_OUTPUTXBAR1             0x00481405U
#define GPIO_58_SPIB_CLK                0x00481406U
#define GPIO_58_LINA_TX                 0x00481409U
#define GPIO_58_MCANB_TX                0x0048140AU
#define GPIO_58_EQEP1_STROBE            0x0048140BU
#define GPIO_58_FSIRXA_D0               0x0048140EU

#define GPIO_59_GPIO59                  0x00481600U
#define GPIO_59_OUTPUTXBAR2             0x00481605U
#define GPIO_59_SPIB_PTE                0x00481606U
#define GPIO_59_LINA_RX                 0x00481609U
#define GPIO_59_MCANB_RX                0x0048160AU
#define GPIO_59_EQEP1_INDEX             0x0048160BU

#define GPIO_60_GPIO60                  0x00481800U
#define GPIO_60_EPWM12_B                0x00481801U
#define GPIO_60_MCANA_TX                0x00481803U
#define GPIO_60_OUTPUTXBAR3             0x00481805U
#define GPIO_60_SPIB_PICO               0x00481806U

