TexasInstruments/c2000ware-core-sdk/driverlib/f28p55x/driverlib/pin_map.h
#define GPIO_61_GPIO61                  0x00481A00U
#define GPIO_61_MCANA_RX                0x00481A03U
#define GPIO_61_OUTPUTXBAR4             0x00481A05U
#define GPIO_61_SPIB_POCI               0x00481A06U
#define GPIO_61_MCANB_RX                0x00481A0EU

#define GPIO_62_GPIO62                  0x00481C00U
#define GPIO_62_EPWM10_A                0x00481C01U
#define GPIO_62_OUTPUTXBAR3             0x00481C02U
#define GPIO_62_MCANA_TX                0x00481C05U
#define GPIO_62_SCIA_TX                 0x00481C06U
#define GPIO_62_PMBUSA_SDA              0x00481C09U

#define GPIO_63_GPIO63                  0x00481E00U
#define GPIO_63_EPWM10_B                0x00481E01U
#define GPIO_63_OUTPUTXBAR4             0x00481E02U
#define GPIO_63_MCANA_RX                0x00481E05U
#define GPIO_63_SCIA_RX                 0x00481E06U
#define GPIO_63_LINA_RX                 0x00481E09U

#define GPIO_64_GPIO64                  0x00860000U
#define GPIO_64_SCIA_RX                 0x00860001U
#define GPIO_64_EPWM11_A                0x00860002U
#define GPIO_64_EPWM7_A                 0x00860003U
#define GPIO_64_OUTPUTXBAR5             0x00860005U
#define GPIO_64_EQEP1_A                 0x00860006U
#define GPIO_64_EQEP2_STROBE            0x00860009U
#define GPIO_64_LINA_TX                 0x0086000AU
#define GPIO_64_SPIB_CLK                0x0086000BU
#define GPIO_64_ERRORSTS                0x0086000DU
#define GPIO_64_I2CB_SDA                0x0086000EU

#define GPIO_65_GPIO65                  0x00860200U
#define GPIO_65_EQEP1_A                 0x00860201U
#define GPIO_65_EPWM11_B                0x00860202U
#define GPIO_65_SPIB_PICO               0x00860206U
#define GPIO_65_MCANA_TX                0x00860209U
#define GPIO_65_I2CA_SCL                0x0086020BU

#define GPIO_66_GPIO66                  0x00860400U
#define GPIO_66_EQEP1_B                 0x00860401U
#define GPIO_66_EPWM12_A                0x00860402U
#define GPIO_66_SPIB_POCI               0x00860406U
#define GPIO_66_MCANA_RX                0x00860409U
#define GPIO_66_I2CA_SDA                0x0086040BU

#define GPIO_67_GPIO67                  0x00860600U
#define GPIO_67_EPWM7_B                 0x00860601U
#define GPIO_67_EPWM12_B                0x00860602U
#define GPIO_67_MCANA_TX                0x00860603U
#define GPIO_67_EQEP1_INDEX             0x00860605U
#define GPIO_67_SCIB_RX                 0x00860606U
#define GPIO_67_PMBUSA_ALERT            0x00860607U
#define GPIO_67_FSIRXA_CLK              0x00860609U
#define GPIO_67_LINA_RX                 0x0086060AU
#define GPIO_67_SPIA_POCI               0x0086060BU
#define GPIO_67_SCIC_RX                 0x0086060FU

#define GPIO_68_GPIO68                  0x00860800U
#define GPIO_68_EPWM7_A                 0x00860801U
#define GPIO_68_EPWM3_A                 0x00860802U
#define GPIO_68_MCANA_RX                0x00860803U
#define GPIO_68_EQEP1_STROBE            0x00860805U
#define GPIO_68_SCIB_TX                 0x00860806U
#define GPIO_68_PMBUSA_CTL              0x00860807U
#define GPIO_68_FSIRXA_D0               0x00860809U
#define GPIO_68_LINA_TX                 0x0086080AU
#define GPIO_68_SPIA_CLK                0x0086080BU
#define GPIO_68_SCIC_TX                 0x0086080FU

#define GPIO_69_GPIO69                  0x00860A00U
#define GPIO_69_EPWM6_B                 0x00860A01U
#define GPIO_69_EPWM3_B                 0x00860A02U
#define GPIO_69_OUTPUTXBAR7             0x00860A03U
#define GPIO_69_EQEP1_B                 0x00860A05U
#define GPIO_69_SCIB_RX                 0x00860A06U
#define GPIO_69_SPIA_PTE                0x00860A07U
#define GPIO_69_FSIRXA_D1               0x00860A09U
#define GPIO_69_LINA_RX                 0x00860A0AU
#define GPIO_69_EQEP2_A                 0x00860A0BU
#define GPIO_69_SPIA_PICO               0x00860A0DU
#define GPIO_69_EQEP3_INDEX             0x00860A0FU

#define GPIO_70_GPIO70                  0x00860C00U
#define GPIO_70_I2CA_SCL                0x00860C01U
#define GPIO_70_SPIB_PTE                0x00860C03U
#define GPIO_70_OUTPUTXBAR4             0x00860C05U
#define GPIO_70_LINA_RX                 0x00860C06U
#define GPIO_70_FSIRXA_CLK              0x00860C09U
#define GPIO_70_MCANA_RX                0x00860C0AU
#define GPIO_70_EQEP2_B                 0x00860C0BU
#define GPIO_70_ADCSOCAO                0x00860C0DU
#define GPIO_70_EQEP3_A                 0x00860C0FU

#define GPIO_71_GPIO71                  0x00860E00U
#define GPIO_71_SPIA_PICO               0x00860E01U
#define GPIO_71_EPWM4_B                 0x00860E02U
#define GPIO_71_OUTPUTXBAR7             0x00860E03U
#define GPIO_71_EPWM9_A                 0x00860E05U
#define GPIO_71_SCIA_TX                 0x00860E06U
#define GPIO_71_EQEP1_STROBE            0x00860E09U
#define GPIO_71_PMBUSA_SCL              0x00860E0AU
#define GPIO_71_XCLKOUT                 0x00860E0BU
#define GPIO_71_EQEP2_INDEX             0x00860E0DU
#define GPIO_71_SPIB_POCI               0x00860E0EU
#define GPIO_71_EQEP3_STROBE            0x00860E0FU

#define GPIO_72_GPIO72                  0x00861000U
#define GPIO_72_SPIA_POCI               0x00861001U
#define GPIO_72_EPWM5_A                 0x00861002U
#define GPIO_72_OUTPUTXBAR8             0x00861003U
#define GPIO_72_EPWM9_B                 0x00861005U
#define GPIO_72_SCIA_RX                 0x00861006U
#define GPIO_72_EQEP1_INDEX             0x00861009U
#define GPIO_72_PMBUSA_SDA              0x0086100AU
#define GPIO_72_MCANA_TX                0x0086100BU
#define GPIO_72_EPWM6_A                 0x0086100EU
#define GPIO_72_EQEP3_B                 0x0086100FU

#define GPIO_73_GPIO73                  0x00861200U
#define GPIO_73_OUTPUTXBAR1             0x00861201U
#define GPIO_73_EPWM5_B                 0x00861202U
#define GPIO_73_SPIA_PTE                0x00861203U
#define GPIO_73_EPWM8_A                 0x00861205U
#define GPIO_73_SPIB_PICO               0x00861206U
#define GPIO_73_LINA_TX                 0x00861209U
#define GPIO_73_PMBUSA_SCL              0x0086120AU
#define GPIO_73_SCIA_TX                 0x0086120BU
#define GPIO_73_ERRORSTS                0x0086120DU
#define GPIO_73_EPWM9_A                 0x0086120EU

#define GPIO_74_GPIO74                  0x00861400U
#define GPIO_74_EPWM2_B                 0x00861401U
#define GPIO_74_ADCSOCAO                0x00861403U
#define GPIO_74_MCANA_TX                0x00861405U
#define GPIO_74_SPIA_POCI               0x00861406U
#define GPIO_74_EQEP1_B                 0x0086140BU

#define GPIO_75_GPIO75                  0x00861600U
#define GPIO_75_EPWM1_B                 0x00861601U
#define GPIO_75_LINA_RX                 0x00861603U
#define GPIO_75_EPWM6_A                 0x00861605U
#define GPIO_75_SPIA_CLK                0x00861606U
#define GPIO_75_EQEP1_STROBE            0x0086160BU
#define GPIO_75_SCIC_RX                 0x0086160EU

#define GPIO_76_GPIO76                  0x00861800U
#define GPIO_76_EPWM4_A                 0x00861801U
#define GPIO_76_OUTPUTXBAR2             0x00861805U
#define GPIO_76_SPIA_PTE                0x00861806U
#define GPIO_76_MCANA_RX                0x0086180AU
#define GPIO_76_EQEP1_INDEX             0x0086180BU

#define GPIO_77_GPIO77                  0x00861A00U
#define GPIO_77_EPWM1_A                 0x00861A01U
#define GPIO_77_OUTPUTXBAR3             0x00861A05U
#define GPIO_77_SPIA_PICO               0x00861A06U
#define GPIO_77_MCANA_TX                0x00861A0AU
#define GPIO_77_EQEP1_A                 0x00861A0BU
#define GPIO_77_SCIC_TX                 0x00861A0EU

