TexasInstruments/c2000ware-core-sdk/driverlib/f28p55x/driverlib/pin_map.h
#define GPIO_78_GPIO78                  0x00861C00U
#define GPIO_78_EPWM8_A                 0x00861C02U
#define GPIO_78_EPWM3_A                 0x00861C03U
#define GPIO_78_OUTPUTXBAR1             0x00861C05U
#define GPIO_78_EPWM2_B                 0x00861C06U
#define GPIO_78_FSITXA_CLK              0x00861C09U

#define GPIO_79_GPIO79                  0x00861E00U
#define GPIO_79_EPWM8_B                 0x00861E02U
#define GPIO_79_EPWM3_B                 0x00861E03U
#define GPIO_79_MCANA_RX                0x00861E05U
#define GPIO_79_EPWM2_A                 0x00861E06U
#define GPIO_79_I2CA_SDA                0x00861E07U
#define GPIO_79_PMBUSA_SCL              0x00861E09U

#define GPIO_80_GPIO80                  0x00880000U
#define GPIO_80_EPWM1_A                 0x00880001U
#define GPIO_80_OUTPUTXBAR7             0x00880003U
#define GPIO_80_SCIA_RX                 0x00880005U
#define GPIO_80_I2CB_SDA                0x00880006U
#define GPIO_80_SPIA_PTE                0x00880007U
#define GPIO_80_FSITXA_D0               0x00880009U
#define GPIO_80_MCANA_RX                0x0088000AU
#define GPIO_80_CLB_OUTPUTXBAR8         0x0088000BU
#define GPIO_80_EQEP1_INDEX             0x0088000DU
#define GPIO_80_EPWM3_A                 0x0088000FU

#define GPIO_81_GPIO81                  0x00880200U
#define GPIO_81_EPWM1_B                 0x00880201U
#define GPIO_81_OUTPUTXBAR6             0x00880202U
#define GPIO_81_SCIC_RX                 0x00880203U
#define GPIO_81_SPIB_CLK                0x00880205U
#define GPIO_81_I2CB_SCL                0x00880206U
#define GPIO_81_FSITXA_D1               0x00880209U
#define GPIO_81_MCANA_TX                0x0088020AU
#define GPIO_81_EQEP3_INDEX             0x0088020BU

#define GPIO_208_GPIO208                0x01880000U

#define GPIO_209_GPIO209                0x01880200U

#define GPIO_210_GPIO210                0x01880400U

#define GPIO_211_GPIO211                0x01880600U
#define GPIO_211_EPWM10_A               0x01880601U
#define GPIO_211_EQEP3_A                0x01880605U

#define GPIO_212_GPIO212                0x01880800U
#define GPIO_212_EPWM10_B               0x01880801U
#define GPIO_212_EQEP3_B                0x01880805U

#define GPIO_213_GPIO213                0x01880A00U
#define GPIO_213_EPWM11_A               0x01880A01U
#define GPIO_213_EQEP3_STROBE           0x01880A05U

#define GPIO_214_GPIO214                0x01880C00U
#define GPIO_214_EPWM11_B               0x01880C01U
#define GPIO_214_EQEP3_INDEX            0x01880C05U

#define GPIO_215_GPIO215                0x01880E00U
#define GPIO_215_EPWM7_B                0x01880E01U
#define GPIO_215_EQEP2_A                0x01880E05U

#define GPIO_224_GPIO224                0x01C60000U
#define GPIO_224_EPWM11_B               0x01C60001U
#define GPIO_224_OUTPUTXBAR3            0x01C60005U
#define GPIO_224_SPIA_PICO              0x01C60006U
#define GPIO_224_EPWM1_A                0x01C60009U
#define GPIO_224_MCANA_TX               0x01C6000AU
#define GPIO_224_EQEP1_A                0x01C6000BU
#define GPIO_224_ADCE_EXTMUXSEL3        0x01C6000DU
#define GPIO_224_SCIC_TX                0x01C6000EU

#define GPIO_225_GPIO225                0x01C60200U

#define GPIO_226_GPIO226                0x01C60400U
#define GPIO_226_EPWM10_B               0x01C60401U
#define GPIO_226_LINA_RX                0x01C60403U
#define GPIO_226_EPWM6_A                0x01C60405U
#define GPIO_226_SPIA_CLK               0x01C60406U
#define GPIO_226_EPWM1_B                0x01C60409U
#define GPIO_226_EQEP1_STROBE           0x01C6040BU
#define GPIO_226_ADCE_EXTMUXSEL1        0x01C6040DU
#define GPIO_226_SCIC_RX                0x01C6040EU

#define GPIO_227_GPIO227                0x01C60600U
#define GPIO_227_I2CB_SCL               0x01C60601U
#define GPIO_227_EPWM3_A                0x01C60603U
#define GPIO_227_OUTPUTXBAR1            0x01C60605U
#define GPIO_227_EPWM2_B                0x01C60606U

#define GPIO_228_GPIO228                0x01C60800U
#define GPIO_228_EPWM10_A               0x01C60801U
#define GPIO_228_ADCSOCAO               0x01C60803U
#define GPIO_228_MCANA_TX               0x01C60805U
#define GPIO_228_SPIA_POCI              0x01C60806U
#define GPIO_228_EPWM2_B                0x01C60809U
#define GPIO_228_EQEP1_B                0x01C6080BU
#define GPIO_228_ADCE_EXTMUXSEL0        0x01C6080DU

#define GPIO_229_GPIO229                0x01C60A00U

#define GPIO_230_GPIO230                0x01C60C00U
#define GPIO_230_I2CB_SDA               0x01C60C01U
#define GPIO_230_EPWM3_B                0x01C60C03U
#define GPIO_230_MCANA_RX               0x01C60C05U
#define GPIO_230_EPWM2_A                0x01C60C06U
#define GPIO_230_I2CA_SDA               0x01C60C07U
#define GPIO_230_PMBUSA_SCL             0x01C60C09U

#define GPIO_231_GPIO231                0x01C60E00U

#define GPIO_232_GPIO232                0x01C61000U

#define GPIO_233_GPIO233                0x01C61200U

#define GPIO_234_GPIO234                0x01C61400U

#define GPIO_235_GPIO235                0x01C61600U

#define GPIO_236_GPIO236                0x01C61800U
#define GPIO_236_EPWM7_A                0x01C61801U
#define GPIO_236_EQEP1_INDEX            0x01C61805U
#define GPIO_236_EPWM12_A               0x01C61809U

#define GPIO_237_GPIO237                0x01C61A00U

#define GPIO_238_GPIO238                0x01C61C00U

#define GPIO_239_GPIO239                0x01C61E00U

#define GPIO_240_GPIO240                0x01C80000U

#define GPIO_241_GPIO241                0x01C80200U

#define GPIO_242_GPIO242                0x01C80400U
#define GPIO_242_EPWM11_A               0x01C80401U
#define GPIO_242_OUTPUTXBAR2            0x01C80405U
#define GPIO_242_SPIA_PTE               0x01C80406U
#define GPIO_242_EPWM4_A                0x01C80409U
#define GPIO_242_MCANA_RX               0x01C8040AU
#define GPIO_242_EQEP1_INDEX            0x01C8040BU
#define GPIO_242_ADCE_EXTMUXSEL2        0x01C8040DU

#define GPIO_244_GPIO244                0x01C80800U

#define GPIO_245_GPIO245                0x01C80A00U

#define GPIO_247_GPIO247                0x01C80E00U
#define GPIO_247_EPWM12_B               0x01C80E01U

#define GPIO_248_GPIO248                0x01C81000U

#define GPIO_249_GPIO249                0x01C81200U

#define GPIO_251_GPIO251                0x01C81600U

#define GPIO_252_GPIO252                0x01C81800U

#define GPIO_253_GPIO253                0x01C81A00U
#define GPIO_253_EPWM12_A               0x01C81A01U

#endif // PIN_MAP_H
